Revit 2027 API
PrintParameters.PaperPlacement Property
 The paper placement type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PaperPlacementType PaperPlacement { get; set; }
Public Property PaperPlacement As PaperPlacementType
	Get
	Set
public:
property PaperPlacementType PaperPlacement {
	PaperPlacementType get ();
	void set (PaperPlacementType value);
}
member PaperPlacement : PaperPlacementType with get, set
Property Value
PaperPlacementType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Thrown when the input argument is out of range.
See Also
Reference
PrintParameters Class
Autodesk.Revit.DB Namespace